Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/lexer-omegat.tmx
Source language: en_us
Languages: pt_br

source: Lexer to Editor Bridge
pt_br: Ponte do editor com o Lexer

source: Editing
pt_br: Edição

source: Enables use of the lexer module with the current editor
pt_br: Habilita a utilização do módulo lexer com o editor atual

source: This is the bridge module that allows the lexersproduced by the lexer module to be used with the current editor module.This is temporary solution until the editor module will be built on topof the lexer module.
pt_br: Este é a ponte que permite aos lexers produzidos pelo módulo lexer serem utilizado com o módulo de edição atual. Esta é uma solução temporaria até que o módulo de edição seja construído sobre o módulo do lexer.

source: Enables lexical analysis
pt_br: Habilita analise lexicais

source: The Lexer module supports incremental lexing over a Swing document.
pt_br: O módulo Lexer suporta aplicação lexer ao longo de um documento Swing.

source: It also supports batch lexing over stream inputs.
pt_br: Também suporta aplicação lexer em lote sobre entradas de fluxo.

source: The produced token information can be used by editor for syntax coloring but also by other modules that require lexical analysis.
pt_br: A informação de símbolo produzido pode ser utilizada pelo editor para coloração de syntaxe e também por outros módulos que necessitem de análise léxica.

source: Provides LanguageProvider implementation that gets the language descriptions from MimeLookup so the languages can be registered in xml-layer.
pt_br: Disponibiliza uma implementação de LanguageProvider a qual obtem as descrições de linguagem a partir do MimeLookup, desta forma as linguagens podem ser registradas no XML de camada.

source: Lexer to NetBeans Bridge
pt_br: Lexer para Ponte NetBeans

source: Allows to search for language descriptions by using MimeLookup
pt_br: Permite a pesquisa de descrições de linguagens através do MimeLookup
